src/Documents/Инвентаризация/Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвентаризация</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Инвентаризация/ObjectModule.bsl
Процедура ЗаполнитьПоОстаткам()
    Товары.Очистить();
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |    Остатки.Ячейка,
    |    Остатки.Номенклатура,
    |    Остатки.КоличествоОстаток КАК Количество
    |ИЗ
    |    РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад) КАК Остатки";
    Запрос.УстановитьПараметр("Склад", Склад);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Строка = Товары.Добавить();
        Строка.Номенклатура = Выборка.Номенклатура;
        Строка.Ячейка = Выборка.Ячейка;
        Строка.УчетноеКоличество = Выборка.Количество;
        Строка.ФактическоеКоличество = Выборка.Количество; // человек потом поправит вручную
    КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Движения.ОстаткиТоваров.Записывать = Истина;
    Для Каждого Строка Из Товары Цикл
        Отклонение = Строка.ФактическоеКоличество - Строка.УчетноеКоличество;
        Если Отклонение = 0 Тогда
            Продолжить;
        КонецЕсли;

        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.Склад = Склад;
        Движение.Ячейка = Строка.Ячейка;
        Движение.Номенклатура = Строка.Номенклатура;
        Движение.Количество = ?(Отклонение < 0, -Отклонение, Отклонение);
        Если Отклонение > 0 Тогда
            Движение.ВидДвижения = ВидДвиженияНакопления.Приход; // излишек
        Иначе
            Движение.ВидДвижения = ВидДвиженияНакопления.Расход; // недостача
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры
